TestCases/movingSquare/backgroundMesh/0/pointMotionU

    /*--------------------------------*- C++ -*----------------------------------*    | =========                 |                                                 |
    | \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
    |  \    /   O peration     | Version:  v2012                                 |
    |   \  /    A nd           | Website:  www.openfoam.com                      |
    |    \/     M anipulation  |                                                 |
    \*---------------------------------------------------------------------------*/
    FoamFile
    {
        version     2.0;
        format      ascii;
        class       pointVectorField;
        object      pointMotionU;
    }
    // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    dimensions      [0 1 -1 0 0 0 0];

    internalField   uniform (0 0 0);

    boundaryField
    {
        ".*"
        {
            type            uniformFixedValue;
            uniformValue    (0 0 0);
        }
    
    

        "overset1|movingWall"
        {
            type            uniformFixedValue;
            uniformValue    (0 0.4 0);
        }
    }
